Repository: erazero1/musiva
Catalog: lib/l10n/app_*.arb
Languages: kk

# display_name_label
source: Display Name
kk: Көрсетілетің атау

# enter_your_name_label
source: Please enter your name
kk: Атыңызды еңгізіңіз

# email_label
source: Email
kk: Эл. пошта

# enter_your_email_label
source: Please enter your email
kk: Эл. поштаны еңгізіңіз

# enter_valid_email
source: Please enter a valid email
kk: Дұрыс эл. поштаны енгізіңіз

# password_label
source: Password
kk: Құпия сөз

# enter_your_password
source: Please enter your password'
kk: Құпия сөзді еңгізіңіз

# enter_valid_password
source: Password must be at least 8 characters
kk: Құпия сөзде кемінде 8 таңба болуы тиіс

# join_musiva_label
source: Join Musiva to discover and enjoy your favorite music
kk: Musiva-ға қосылып, сүйікті музыкаңызды тауып, ләззат алыңыз

# create_account_label
source: Create Account
kk: Аккаунт тіркеу

# register_label
source: Register
kk: Тіркелу

# already_have_account_label
source: Already have an account?
kk: Аккаунт бар ма?

# login_label
source: Login
kk: Кіру

# dont_have_account_label
source: Don't have an account?
kk: Аккаунт жоқ па?

# songs_label
source: Songs
kk: Әндер

# library_label
source: Library
kk: Әндер жинағы

# upload_label
source: Upload
kk: Жүктеу

# profile_label
source: Profile
kk: Профиль

# failed_to_load_library_label
source: Failed to load library
kk: Әндер жинағын жүктеу сәтсіз аяқталды

# retry_label
source: Retry
kk: Қайталап көру

# recently_played_label
source: Recently Played
kk: Соңғы ойналғандар

# your_playlists_label
source: Your Playlists
kk: Сіздің әндер жинағыңыз

# favorites_label
source: Favorites
kk: Сүйіктілер

# downloads_label
source: Downloads
kk: Жүктеулер

# view_all_label
source: View All
kk: Барлығын көру

# create_playlist_label
source: Create Playlist
kk: Әндер жинағың жасау

# error_label
source: Error
kk: Қате

# loading_profile_label
source: Loading Profile...
kk: Профиль жүктелуде...

# edit_profile_label
source: Edit Profile
kk: Профильді өңдеу

# settings_label
source: Settings
kk: Параметрлер

# help_support_label
source: Help & Support
kk: Көмек және қолдау

# logout_label
source: Logout
kk: Шығу

# uploaded_successfully_label
source: Uploaded successfully
kk: Сәтті жүктелді

# upload_failed_label
source: Upload failed
kk: Жүктеу сәтсіз аяқталды

# select_mp3_file_label
source: Select MP3 File
kk: MP3 файлын таңдаңыз

# selected_file_label
source: Selected file
kk: Таңдалған файл

# browse_files_label
source: Browse Files
kk: Файлдарды шолу

# song_details_label
source: Song Details
kk: Ән мәліметтері

# title_label
source: Title
kk: Атауы

# artist_label
source: Artist
kk: Орындаушы

# artwork_url_label
source: Artwork URL
kk: Мұқаба сілтемесі

# uploading_label
source: Uploading...
kk: Жүктелуде...

# upload_song_label
source: Upload Song
kk: Ән жүктеу

# song_label
source: Song
kk: Ән

# language_label
source: Language
kk: Тіл

# choose_language_label
source: Choose language
kk: Тілді таңдаңыз

# switch_theme_label
source: Switch theme
kk: Тақырыпты ауыстыру

# failed_to_load_songs_label
source: Failed to load songs
kk: Әндер жүктелмеді

# all_label
source: All
kk: Барлық

# recent_label
source: Recent
kk: Соңғы

# popular_label
source: Popular
kk: Таңымалы

# trending_label
source: Trending
kk: Трендте

# play_now_label
source: Play Now
kk: Қазір ойнату

# add_to_playlist_label
source: Add to playlist
kk: Әндер жинағына қосу

# add_to_favorites_label
source: Add to favorites
kk: Сүйіктілерге қосу

# share_label
source: Share
kk: Бөлісу

# download_label
source: Download
kk: Жүктеп алу

# song_title_label
source: Song Title
kk: Ән атауы

# artist_name_label
source: Artist Name
kk: Орындаушының аты

source: Continue as guest
kk: Қонақ ретінде жалғастыру

# sing_in_with_google
source: Sign in with Google
kk: Google жүйесімен кіру

# guest_mode_warning
source: Guest Mode: Limited Access
kk: Қонақ режімі. Қол жетімділік шектеулі

# dark_theme_label
source: Dark theme
kk: Қараңғы тақырып

# light_theme_label
source: Light theme
kk: Жарық тақырып

# search_songs_label
source: Search songs
kk: Әндерді іздеу

# search_for_songs_label
source: Search for your favorite songs
kk: Сүйікті әндеріңізді іздеңіз

# no_results_found_label
source: No results found for
kk: Сұраныс бойынша нәтиже табылмады

# search_result_label
source: Search results
kk: Іздеу нәтижелері

# file_not_exist_error
source: Selected file does not exist: {filePath}
kk: Таңдалған файл жоқ: {filePath}

# invalid_file_format_error
source: Invalid file format. Only MP3 files are supported.
kk: Файл пішімі жарамсыз. Тек MP3 файлдары қолдау көрсетіледі.

# file_too_large_error
source: File is too large. Maximum size is 20MB.
kk: Файл тым үлкен. Максималды өлшемі 20МБ.

# metadata_extraction_error
source: Failed to extract metadata: {error}
kk: Метадеректерді шығару сәтсіз аяқталды: {error}

# audio_file_selection_error
source: Error selecting audio file: {error}
kk: Аудио файлды таңдау кезінде қате: {error}

# no_audio_file_selected_error
source: No audio file selected. Please select a file first.
kk: Аудио файл таңдалмаған. Алдымен файлды таңдаңыз.

# song_title_empty_error
source: Song title cannot be empty
kk: Ән атауы бос болмауы керек

# artist_name_empty_error
source: Artist name cannot be empty
kk: Орындаушы аты бос болмауы керек

# song_info_update_error
source: Error updating song info: {error}
kk: Ән туралы ақпаратты жаңарту кезінде қате: {error}

# song_info_incomplete_error
source: Song information is incomplete. Please provide title and artist.
kk: Ән туралы ақпарат толық емес. Атауы мен орындаушыны көрсетіңіз.

# song_upload_error
source: Error uploading song: {error}
kk: Әнді жүктеу кезінде қате: {error}

# using_embedded_artwork
source: Using embedded artwork from metadata
kk: Метадеректерден кіріктірілген мұқаба қолданылуда

# file_path_empty_error
source: File path cannot be empty
kk: Файл жолы бос болмауы керек

source: Failed to upload song: {error}
kk: Әнді жүктеу сәтсіз аяқталды: {error}

# song_file_not_exist_error
source: Song file does not exist at path: {filePath}
kk: Ән файлы жолда жоқ: {filePath}

# songs_not_implemented_error
source: getSongs method is not implemented in this repository
kk: getSongs әдісі бұл репозиторийде іске асырылмаған

# metadata_found_label
source: Metadata was found in this file. You can edit the information below if needed.
kk: Бұл файлда метадеректер табылды. Төмендегі ақпаратты қажет болса өңдей аласыз.

# enter_song_title_hint
source: Enter song title (required)
kk: Ән атауын енгізіңіз (міндетті)

# song_title_required_error
source: Song title is required
kk: Ән атауы міндетті

# enter_artist_name_hint
source: Enter artist name (required)
kk: Орындаушы атын енгізіңіз (міндетті)

# artist_name_required_error
source: Artist name is required
kk: Орындаушы аты міндетті

# artwork_optional_label
source: Artwork (Optional)
kk: Мұқаба (Міндетті емес)

# from_metadata_label
source: From Metadata
kk: Метадеректерден

# default_cover_note
source: Default cover will be used if none provided
kk: Егер көрсетілмесе, әдепкі мұқаба қолданылады

# upload_image_label
source: Upload Image
kk: Сурет жүктеу

# artwork_url_hint
source: https://example.com/artwork.jpg (optional)
kk: https://example.com/artwork.jpg (міндетті емес)

# embedded_artwork_found_label
source: Embedded artwork found:
kk: Кіріктірілген мұқаба табылды:

# using_embedded_artwork_message
source: Using embedded artwork
kk: Кіріктірілген мұқаба қолданылуда

# default_placeholder_used_label
source: Default placeholder will be used:
kk: Әдепкі мұқаба қолданылады:

# default_placeholder_image_label
source: Default placeholder image
kk: Әдепкі мұқаба суреті

# select_cover_image_label
source: Select Cover Image
kk: Мұқаба таңдау

# change_cover_image_label
source: Change Cover Image
kk: Мұқабаны өзгерту

# fill_required_fields_message
source: Please fill in all required fields marked with *
kk: * белгіленген барлық міндетті өрістерді толтырыңыз

source: Unknown playback error
kk: Белгісіз ойнату қатесі

source: No more songs in queue
kk: Кезекте әндер жоқ

source: End of queue reached
kk: Кезек соңына жетті

# failed_to_initialize_audio_player
source: Failed to initialize audio player: {error}
kk: Аудио ойнатқышты іске қосу сәтсіз аяқталды: {error}

# failed_to_initialize_player
source: Failed to initialize player: {error}
kk: Ойнатқышты іске қосу сәтсіз аяқталды: {error}

# failed_to_play_song
source: Failed to play "{title}": {error}
kk: "{title}" әнін ойнату сәтсіз аяқталды: {error}

source: No song to play
kk: Ойнатуға ән жоқ

# failed_to_pause_song
source: Failed to pause song: {error}
kk: Әнді кідірту сәтсіз аяқталды: {error}

# failed_to_resume_song
source: Failed to resume song: {error}
kk: Әнді жалғастыру сәтсіз аяқталды: {error}

# previous_song_label
source: Previous song
kk: Алдыңғы ән

# next_song_label
source: Next song
kk: Келесі ән

# play_label
source: Play
kk: Ойнату

# pause_label
source: Pause
kk: Кідірту

# shuffle_on_label
source: Shuffle is on
kk: Араластыру қосулы

# shuffle_off_label
source: Shuffle is off
kk: Араластыру өшірулі

# turn_shuffle_on_label
source: Turn shuffle on
kk: Араластыруды қосу

# turn_shuffle_off_label
source: Turn shuffle off
kk: Араластыруды өшіру

# repeat_off_label
source: Repeat is off
kk: Қайталау өшірулі

# repeat_one_song_label
source: Repeat one song
kk: Бір әнді қайталау

# repeat_all_songs_label
source: Repeat all songs
kk: Барлық әндерді қайталау

# turn_repeat_off_label
source: Turn repeat off
kk: Қайталауды өшіру

# queue_empty_label
source: Queue is empty
kk: Кезек бос
